// 1962.cpp : 此文件包含 "main" 函数。程序执行将在此处开始并结束。
//
/*

1962：【13NOIP普及组】表达式求值

时间限制: 1000 ms         内存限制: 131072 KB
提交数: 1171     通过数: 516
【题目描述】
给定一个只包含加法和乘法的算术表达式，请你编程计算表达式的值。

【输入】
输入仅有一行，为需要你计算的表达式，表达式中只包含数字、加法运算符“+”和乘法运算符“∗”，且没有括号，所有参与运算的数字均为 0 到 231−1 之间的整数。输入数据保证这一行只有 0∼9、+、∗这 12 种字符。

【输出】
输出只有一行，包含一个整数，表示这个表达式的值。注意：当答案长度多于 4 位时，

请只输出最后 4 位，前导 0 不输出。
*/
#include <iostream>

int main()
{
    std::cout << "Hello World!\n";
}

// 运行程序: Ctrl + F5 或调试 >“开始执行(不调试)”菜单
// 调试程序: F5 或调试 >“开始调试”菜单

// 入门使用技巧: 
//   1. 使用解决方案资源管理器窗口添加/管理文件
//   2. 使用团队资源管理器窗口连接到源代码管理
//   3. 使用输出窗口查看生成输出和其他消息
//   4. 使用错误列表窗口查看错误
//   5. 转到“项目”>“添加新项”以创建新的代码文件，或转到“项目”>“添加现有项”以将现有代码文件添加到项目
//   6. 将来，若要再次打开此项目，请转到“文件”>“打开”>“项目”并选择 .sln 文件
