// 1915.cpp : 此文件包含 "main" 函数。程序执行将在此处开始并结束。
//
/*
【题目描述】
二个正整数x0,y0(2≤x0≤100000,2≤y0≤1000000),求满足下列条件的P,Q的个数。

条件：

1.P,Q是正整数；

2.要求P,Q以x0为最大公约数，以y0为最小公倍数。

试求：满足条件的所有可能的两个正整数的个数。

【输入】
输入x0和y0

【输出】
满足条件的所有可能的两个正整数的个数

【输入样例】
3 60
【输出样例】
4
【提示】
样例说明:此时的P Q分别为：

3 60

15 12

12 15

60 3

*/

// 求最大公约数和最小公倍数

#include <iostream>

int main()
{
    std::cout << "Hello World!\n";
}

// 运行程序: Ctrl + F5 或调试 >“开始执行(不调试)”菜单
// 调试程序: F5 或调试 >“开始调试”菜单

// 入门使用技巧: 
//   1. 使用解决方案资源管理器窗口添加/管理文件
//   2. 使用团队资源管理器窗口连接到源代码管理
//   3. 使用输出窗口查看生成输出和其他消息
//   4. 使用错误列表窗口查看错误
//   5. 转到“项目”>“添加新项”以创建新的代码文件，或转到“项目”>“添加现有项”以将现有代码文件添加到项目
//   6. 将来，若要再次打开此项目，请转到“文件”>“打开”>“项目”并选择 .sln 文件
